_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РаспределениеИнвестиционногоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РаспределениеИнвестиционногоНДС</Name>
			<Comment>Формирование сводных счетов-фактур для дольщиков (УСО)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьТоваров</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_СдачаОбъектаНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.УСОERP_ЗакрытиеОбъектаСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьНомер</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьДата</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьВыдана</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьЛицо</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НДСИнвестиционный</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПринятиеКУчету</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПередачаИнвестору</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СдачаИнвестору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСПоДДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДСПрочиеРасходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПрочиеРасходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_НДСИнвестиционный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_НДСИнвестиционный</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РаспределениеИнвестиционногоНДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы документа.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	//ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	 // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ОбновитьИтоговыеПоказателиСервер();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Процедура - обработчик события "ПриЧтенииНаСервере" формы документа.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

	ЗаполнитьДеревоПринятиеКУчету();
	ЗаполнитьДеревоСдачаИнвестору();
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УСОERP_МодификацияКонфигурацииКлиент.ПоказатьПредупреждениеДолевогоСтроительства();

КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ОбработкаПроверкиЗаполненияНаСервере" формы документа.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаСервере
// Процедура - обработчик события "ПередЗаписьюНаСервере" формы документа.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	ПерезаполнитьТабличныеЧасти(ТекущийОбъект);
	
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
// Процедура - обработчик события "ПослеЗаписиНаСервере" формы документа.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

	ОбновитьИтоговыеПоказателиСервер();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

&НаКлиенте
// Процедура - обработчик события "ОбработкаОповещения" формы документа.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;

КонецПроцедуры // ОбработкаОповещения()

&НаКлиенте
// Процедура - обработчик события "ПослеЗаписи" формы документа.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры // ПослеЗаписи()

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
//Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
// Процедура вызывается при чтении и создании формы документа на сервере.
//
Процедура ПриЧтенииСозданииНаСервере()

	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);

	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере()

&НаСервере
// Процедура управляет видимостью/доступностью/просмотром элементов формы по установленным условиям.
//
Процедура УправлениеЭлементамиФормы()
	
	   Элементы.ДЗСдачаИнвесторуСчетФактура.Видимость = ПолучитьФункциональнуюОпцию("УСОERP_НоваяУчетнаяПолитикаПоДолевомуСтроительству");
	
КонецПроцедуры // УправлениеЭлементамиФормы()

&НаСервере
// Процедура обновляет элементы дополнительных реквизитов при оповещении с других форм.
//
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()


&НаКлиентеНаСервереБезКонтекста
// Процедура пересчитывает поле ввода "Сумма без НДС" в строке табл. части по данным ставки НДС и суммы НДС.
//
Процедура ПересчитатьСуммуБезНДСВСтрокеТаблицы(СтрокаТаблицы, СтавкаНДС)
	
	ТекущийПроцентНДС		  = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС);
	СтрокаТаблицы.СуммаБезНДС = ?(ТекущийПроцентНДС = 0, 0, СтрокаТаблицы.СуммаНДС / ТекущийПроцентНДС); 
	
КонецПроцедуры // ПересчитатьСуммуБезНДСВСтрокеТаблицы()

&НаКлиентеНаСервереБезКонтекста
// Процедура пересчитывает поле ввода "Сумма без НДС" в строке табл. части по данным ставки НДС и суммы НДС.
//
Процедура ПересчитатьСуммуНДСВСтрокеТаблицы(СтрокаТаблицы, СтавкаНДС) 	
	
	СтрокаТаблицы.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТаблицы.СуммаБезНДС, СтавкаНДС, Ложь);
	
КонецПроцедуры // ПересчитатьСуммуНДСВСтрокеТаблицы()

&НаСервере
Процедура ОбновитьИтоговыеПоказателиСервер()
	
	ДеревоОбъект = РеквизитФормыВЗначение("ДЗПринятиеКУчету",Тип("ДеревоЗначений"));
	ИтогоСуммаНДС_ПринятиеКУчету    = ДеревоОбъект.Строки.Итог("СуммаНДС");
	ИтогоСуммаБезНДС_ПринятиеКУчету = ДеревоОбъект.Строки.Итог("СуммаБезНДС");
	
	ДеревоОбъект = РеквизитФормыВЗначение("ДЗСдачаИнвестору",Тип("ДеревоЗначений"));
	ИтогоСуммаНДС_СдачаИнвестору                 = ДеревоОбъект.Строки.Итог("СуммаНДС");
	ИтогоСуммаБезНДС_СдачаИнвестору              = ДеревоОбъект.Строки.Итог("СуммаБезНДС");
	ИтогоСуммаБезНДСПрочиеРасходы_СдачаИнвестору = ДеревоОбъект.Строки.Итог("СуммаБезНДСПрочиеРасходы");
	ИтогоСуммаНДСПрочиеРасходы_СдачаИнвестору    = ДеревоОбъект.Строки.Итог("СуммаНДСПрочиеРасходы");
	
	ДеревоОбъект=Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоговыеПоказателиПринятиеКУчету(Родитель)
	
	ЭлементыРодителя=Родитель.ПолучитьЭлементы();
	ИтогоСуммаНДС = 0;
	ИтогоСуммаБезНДС = 0;
	Для Каждого ЭлементРодителя ИЗ ЭлементыРодителя Цикл
		ИтогоСуммаНДС = ИтогоСуммаНДС + ЭлементРодителя.СуммаНДС;
		ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + ЭлементРодителя.СуммаБезНДС;
	КонецЦикла;
	Родитель.СуммаНДС    = ИтогоСуммаНДС;
	Родитель.СуммаБезНДС = ИтогоСуммаБезНДС;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтавкуНДСНаСервере(Номенклатура, ДокументПоступления)

	мсСтрок = Объект.НДСИнвестиционный.НайтиСтроки(Новый Структура("Номенклатура, ДокументПоступления", Номенклатура, ДокументПоступления));
	Если мсСтрок.Количество() > 0  Тогда
		возврат мсСтрок[0].СтавкаНДС;
	Иначе	
		Возврат Перечисления.СтавкиНДС.НДС18;	
	КонецЕсли; 

КонецФункции // ()

&НаКлиенте
Процедура НДСИнвестиционныйСуммаБезНДСПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.НДСИнвестиционный.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(ТекущаяСтрока, ТекущаяСтрока.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура НДСИнвестиционныйСуммаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НДСИнвестиционный.ТекущиеДанные;
	ПересчитатьСуммуБезНДСВСтрокеТаблицы(ТекущаяСтрока, ТекущаяСтрока.СтавкаНДС);

КонецПроцедуры

&НаКлиенте
Процедура НДСИнвестиционныйСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НДСИнвестиционный.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(ТекущаяСтрока, ТекущаяСтрока.СтавкаНДС);

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТабличныеЧасти(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		Объект.ПринятиеКУчету.Очистить();
		Объект.СдачаИнвестору.Очистить();
		ДЗПринятиеКУчету.ПолучитьЭлементы().Очистить();
		ДЗСдачаИнвестору.ПолучитьЭлементы().Очистить();
		
		ОбработатьПодчиненныеСтрокиПриПерезаполнении(ДЗПринятиеКУчету, "ПринятиеКУчету");
		ОбработатьПодчиненныеСтрокиПриПерезаполнении(ДЗСдачаИнвестору, "СдачаИнвестору");
	Иначе
		ТекущийОбъект.ПринятиеКУчету.Очистить();
		ТекущийОбъект.СдачаИнвестору.Очистить();
		ОбработатьПодчиненныеСтрокиПриПерезаполнении(ДЗПринятиеКУчету, "ПринятиеКУчету", ТекущийОбъект); 
		ОбработатьПодчиненныеСтрокиПриПерезаполнении(ДЗСдачаИнвестору, "СдачаИнвестору", ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Объект.НДСИнвестиционный.Очистить();
	ПерезаполнитьТабличныеЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	
	Объект.НДСИнвестиционный.Очистить();
	ПерезаполнитьТабличныеЧасти();

КонецПроцедуры

&НаСервере
Процедура СоздатьСчетФактурыНаСервере()
	
	СписокОбъектовНедвижимости = Объект.СдачаИнвестору.Выгрузить( , "ОбъектНедвижимости, Контрагент, Договор, СчетФактура");
	СписокОбъектовНедвижимости.Свернуть("ОбъектНедвижимости, Контрагент, Договор, СчетФактура");
	
	Для Каждого ТекСтрока Из СписокОбъектовНедвижимости Цикл
		
		СтрокиПоОбъектуНедвижимости = Объект.СдачаИнвестору.НайтиСтроки(Новый Структура("ОбъектНедвижимости, Контрагент, Договор, СчетФактура", ТекСтрока.ОбъектНедвижимости, ТекСтрока.Контрагент, ТекСтрока.Договор, ТекСтрока.СчетФактура));
		
		Попытка
			
			Если ЗначениеЗаполнено(ТекСтрока.СчетФактура) Тогда
				НоваяСчетФактура = ТекСтрока.СчетФактура.ПолучитьОбъект();
			Иначе
				НоваяСчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
				НоваяСчетФактура.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			
			НоваяСчетФактура.Дата = Объект.Дата;
			НоваяСчетФактура.Организация = Объект.Организация;
			НоваяСчетФактура.Контрагент = ТекСтрока.Контрагент;
			НоваяСчетФактура.ДокументОснование = Объект.Ссылка;
			НоваяСчетФактура.КодВидаОперации = 27;
			НоваяСчетФактура.Валюта = ТекСтрока.Договор.ВалютаВзаиморасчетов;
			НоваяСчетФактура.ДатаВыставления = Объект.Дата;
			
			СтрокаОснования = НоваяСчетФактура.ДокументыОснования.Добавить();
			СтрокаОснования.ДокументОснование = Объект.Ссылка;
			
			НоваяСчетФактура.Записать(РежимЗаписиДокумента.Запись);
			
			Для Каждого СтрокаСчетФактуры Из СтрокиПоОбъектуНедвижимости Цикл
				СтрокаСчетФактуры.СчетФактура = НоваяСчетФактура.Ссылка;
			КонецЦикла;
			
		Исключение
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаполнитьДеревоСдачаИнвестору();	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактуры(Команда)
	
	Если НЕ Объект.Проведен ИЛИ Модифицированность Тогда
		ПоказатьПредупреждение(,"Необходимо провести документ!");
		Возврат;
	КонецЕсли;
		
	СоздатьСчетФактурыНаСервере();
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнвестиционныйНДСПоОстаткамНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ОбъектСтроительства",Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Дата",Новый Граница(Объект.Дата,ВидГраницы.Включая));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_НДСИнвестиционныйОстатки.Контрагент,
	|	УСОERP_НДСИнвестиционныйОстатки.ДокументПоступления,
	|	УСОERP_НДСИнвестиционныйОстатки.Номенклатура,
	|	УСОERP_НДСИнвестиционныйОстатки.СчетУчетаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18) КАК СтавкаНДС,
	|	УСОERP_НДСИнвестиционныйОстатки.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|	УСОERP_НДСИнвестиционныйОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|	0 КАК СуммаНДСПринятиеКУчету,
	|	УСОERP_НДСИнвестиционныйОстатки.СуммаНДСОстаток КАК СуммаНДСПередачаИнвестору
	|ИЗ
	|	РегистрНакопления.УСОERP_НДСИнвестиционный.Остатки(
	|			&Дата,
	|			Организация = &Организация
	|				И ОбъектСтроительства = &ОбъектСтроительства) КАК УСОERP_НДСИнвестиционныйОстатки";
	
	Объект.НДСИнвестиционный.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнвестиционныйНДСПоОстаткам(Команда)
	
	Если Объект.НДСИнвестиционный.Количество() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьИнвестиционныйНДСПоОстаткамПродолжение",ЭтотОбъект),"Табличная часть будет очищена,продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИнвестиционныйНДСПоОстаткамПродолжение(КодВозвратаДиалога.Да,Новый Структура);
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнвестиционныйНДСПоОстаткамПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИнвестиционныйНДСПоОстаткамНаСервере(); 
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТЧ

&НаСервере
Процедура ЗаполнитьИнвестиционныйНДСНаСервере(РасчетПоСуммеЗатрат, СтруктураОбъектаСтроительства)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация",         Объект.Организация);
	СтруктураПараметров.Вставить("ОбъектСтроительства", Объект.ОбъектСтроительства);
	СтруктураПараметров.Вставить("ДокументОснование",   Объект.ДокументОснование);
	СтруктураПараметров.Вставить("НачалоПериода",       НачалоМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("КонецПериода",        КонецМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("Дата",                Объект.Дата);
	СтруктураПараметров.Вставить("НачалоСтроительства",    НачалоДня(СтруктураОбъектаСтроительства.НачалоСтроительства));
	СтруктураПараметров.Вставить("ОкончаниеСтроительства", КонецДня(СтруктураОбъектаСтроительства.ОкончаниеСтроительства));
	
	ИтогоПлощадьФактическаяПринятиеКУчету = Объект.ДокументОснование.ПринятиеКУчету.Итог("ПлощадьФактическая");
	ИтогоСуммаЗатратПринятиеКУчету        = Объект.ДокументОснование.ПринятиеКУчету.Итог("СуммаЗатрат");
	
	ИтогоПлощадьФактическаяСдачаИнвестору = Объект.ДокументОснование.СдачаИнвестору.Итог("ПлощадьФактическая");
	ИтогоСуммаЗатратСдачаИнвестору        = Объект.ДокументОснование.СдачаИнвестору.Итог("СуммаЗатрат");
	
	ИтогоПлощадьФактическая = ИтогоПлощадьФактическаяПринятиеКУчету + ИтогоПлощадьФактическаяСдачаИнвестору;
	ИтогоСуммаЗатрат        = ИтогоСуммаЗатратПринятиеКУчету + ИтогоСуммаЗатратСдачаИнвестору;
	
	СтруктураПараметров.Вставить("ИтогоПлощадьФактическая",               ИтогоПлощадьФактическая);
	СтруктураПараметров.Вставить("ИтогоСуммаЗатрат",                      ИтогоСуммаЗатрат);
	СтруктураПараметров.Вставить("ИтогоПлощадьФактическаяПринятиеКУчету", ИтогоПлощадьФактическаяПринятиеКУчету);
	СтруктураПараметров.Вставить("ИтогоСуммаЗатратПринятиеКУчету",        ИтогоСуммаЗатратПринятиеКУчету);
	СтруктураПараметров.Вставить("ИтогоПлощадьФактическаяСдачаИнвестору", ИтогоПлощадьФактическаяСдачаИнвестору);
	СтруктураПараметров.Вставить("ИтогоСуммаЗатратСдачаИнвестору",        ИтогоСуммаЗатратСдачаИнвестору);
	
	СтруктураПараметров.Вставить("РасчетПоСуммеЗатрат", РасчетПоСуммеЗатрат);
	
	СтруктураТаблиц = Документы.УСОERP_РаспределениеИнвестиционногоНДС.ПолучитьДанныеЗаполненияИнвестиционныйНДС(СтруктураПараметров);
	
	Объект.НДСИнвестиционный.Загрузить(СтруктураТаблиц.ИнвестиционныйНДС);
	Объект.ПринятиеКУчету.Загрузить(СтруктураТаблиц.ПринятиеКУчету);
	Объект.СдачаИнвестору.Загрузить(СтруктураТаблиц.СдачаИнвестору);
	
	ЗаполнитьДеревоПринятиеКУчету();
	ЗаполнитьДеревоСдачаИнвестору();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнвестиционныйНДСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	СтруктураОбъектаСтроительства = ПроверитьОбъектСтроительства();
	ЗаполнитьИнвестиционныйНДСНаСервере(ДополнительныеПараметры, СтруктураОбъектаСтроительства);
    ОбновитьИтоговыеПоказателиСервер();
	РазвернутьДеревья();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнвестиционныйНДСПоСуммеЗатрат(Команда)
	
	ЗаполнитьИнвестиционныйНДСНаКлиенте(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнвестиционныйНДСПоФактПлощади(Команда)
	
	ЗаполнитьИнвестиционныйНДСНаКлиенте(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьОбъектСтроительства()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ОбъектыСтроительства.Ссылка,
	|	СМ_ОбъектыСтроительства.НачалоСтроительства,
	|	СМ_ОбъектыСтроительства.ОкончаниеСтроительства
	|ИЗ
	|	Справочник.СМ_ОбъектыСтроительства КАК СМ_ОбъектыСтроительства
	|ГДЕ
	|	СМ_ОбъектыСтроительства.ОбъектСтроительства = &ОбъектСтроительства";
	
	Запрос.УстановитьПараметр("ОбъектСтроительства", Объект.ОбъектСтроительства);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		Если НЕ ЗначениеЗаполнено(Выборка.НачалоСтроительства)
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.ОкончаниеСтроительства)
			ИЛИ Выборка.НачалоСтроительства > Выборка.ОкончаниеСтроительства Тогда
			Сообщить("Проверьте корректность заполнения периода строительства у объекта строительства " + Выборка.Ссылка);
			Возврат Новый Структура("НачалоСтроительства, ОкончаниеСтроительства, Проверка", Выборка.НачалоСтроительства, Выборка.ОкончаниеСтроительства, Ложь);
		КонецЕсли; 
		Возврат Новый Структура("НачалоСтроительства, ОкончаниеСтроительства, Проверка", Выборка.НачалоСтроительства, Выборка.ОкончаниеСтроительства, Истина);
	Иначе
		Сообщить("Объект эксплуатации " + Объект.ОбъектСтроительства + " не связан ни с одним объектом строительства!");
		Возврат Новый Структура("Проверка", Ложь);
	КонецЕсли; 
	
КонецФункции // ()

&НаКлиенте
Процедура ЗаполнитьИнвестиционныйНДСНаКлиенте(ПоСуммеЗатрат) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		Сообщить("Необходимо заполнить Объект строительства!");
		Возврат;	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Сообщить("Необходимо заполнить Документ основания!");
		Возврат;	
	КонецЕсли; 
	
	СтруктураОбъектаСтроительства = ПроверитьОбъектСтроительства();
	Если НЕ СтруктураОбъектаСтроительства.Проверка Тогда
		Возврат;	
	КонецЕсли; 
	
	Если Не Объект.НДСИнвестиционный.Количество() = 0 Тогда

		ТекстВопроса = НСтр("ru='Перед заполнением табл. часть ""Инвестиционный НДС"" будет очищена. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьИнвестиционныйНДСЗавершение", ЭтотОбъект, ПоСуммеЗатрат), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;

	КонецЕсли;
	
	ЗаполнитьИнвестиционныйНДСНаСервере(ПоСуммеЗатрат, СтруктураОбъектаСтроительства);
	ОбновитьИтоговыеПоказателиСервер();
	РазвернутьДеревья();
	
	Модифицированность = Истина;
	
КонецПроцедуры	

#КонецОбласти

#Область РаспределениеНДС

&НаСервере
Процедура РаспределитьИнвестиционныйНДСНаСервере(РаспределятьПоСуммеЗатрат)	
	
	СтруктураОбъектаСтроительства = ПроверитьОбъектСтроительства();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация",         Объект.Организация);
	СтруктураПараметров.Вставить("ОбъектСтроительства", Объект.ОбъектСтроительства);
	СтруктураПараметров.Вставить("ДокументОснование",   Объект.ДокументОснование);
	СтруктураПараметров.Вставить("НачалоПериода",       НачалоМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("КонецПериода",        КонецМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("Дата",                Объект.Дата);
	СтруктураПараметров.Вставить("НачалоСтроительства",    НачалоДня(СтруктураОбъектаСтроительства.НачалоСтроительства));
	СтруктураПараметров.Вставить("ОкончаниеСтроительства", КонецДня(СтруктураОбъектаСтроительства.ОкончаниеСтроительства));
	
	ИтогоПлощадьФактическаяПринятиеКУчету = Объект.ДокументОснование.ПринятиеКУчету.Итог("ПлощадьФактическая");
	ИтогоСуммаЗатратПринятиеКУчету        = Объект.ДокументОснование.ПринятиеКУчету.Итог("СуммаЗатрат");
	
	ИтогоПлощадьФактическаяСдачаИнвестору = Объект.ДокументОснование.СдачаИнвестору.Итог("ПлощадьФактическая");
	ИтогоСуммаЗатратСдачаИнвестору        = Объект.ДокументОснование.СдачаИнвестору.Итог("СуммаЗатрат");
	
	ИтогоПлощадьФактическая = ИтогоПлощадьФактическаяПринятиеКУчету + ИтогоПлощадьФактическаяСдачаИнвестору;
	ИтогоСуммаЗатрат        = ИтогоСуммаЗатратПринятиеКУчету + ИтогоСуммаЗатратСдачаИнвестору;
	
	СтруктураПараметров.Вставить("ИтогоПлощадьФактическая",               ИтогоПлощадьФактическая);
	СтруктураПараметров.Вставить("ИтогоСуммаЗатрат",                      ИтогоСуммаЗатрат);
	СтруктураПараметров.Вставить("ИтогоПлощадьФактическаяПринятиеКУчету", ИтогоПлощадьФактическаяПринятиеКУчету);
	СтруктураПараметров.Вставить("ИтогоСуммаЗатратПринятиеКУчету",        ИтогоСуммаЗатратПринятиеКУчету);
	СтруктураПараметров.Вставить("ИтогоПлощадьФактическаяСдачаИнвестору", ИтогоПлощадьФактическаяСдачаИнвестору);
	СтруктураПараметров.Вставить("ИтогоСуммаЗатратСдачаИнвестору",        ИтогоСуммаЗатратСдачаИнвестору);
	
	СтруктураПараметров.Вставить("РасчетПоСуммеЗатрат", РаспределятьПоСуммеЗатрат); 	
	
	СтруктураТаблиц = Документы.УСОERP_РаспределениеИнвестиционногоНДС.ПолучитьДанныеЗаполненияИнвестиционныйНДС(СтруктураПараметров);
	
	Объект.ПринятиеКУчету.Загрузить(СтруктураТаблиц.ПринятиеКУчету);
	Объект.СдачаИнвестору.Загрузить(СтруктураТаблиц.СдачаИнвестору);
	
	
	ТЗПринятиеКУчетуОригинал = Объект.ПринятиеКУчету.Выгрузить();
	ТЗПринятиеКУчетуОригинал.ЗаполнитьЗначения("", "ДокументПоступления");
	ТЗПринятиеКУчетуОригинал.ЗаполнитьЗначения(0, "СуммаБезНДС");
	ТЗПринятиеКУчетуОригинал.ЗаполнитьЗначения(0, "СуммаНДС");
	ТЗПринятиеКУчетуОригинал.ЗаполнитьЗначения("", "СчетСписанияНДС");
	ТЗПринятиеКУчетуОригинал.Свернуть("ОбъектНедвижимости, Номенклатура, ПлощадьФактическая, СуммаЗатрат, СчетУчетаНДС, ДокументПоступления, СчетСписанияНДС, СуммаБезНДС, СуммаНДС");
	
	ТЗПринятиеКУчету = Объект.ПринятиеКУчету.Выгрузить();
	ТЗПринятиеКУчету.Очистить();
	
	ТЗСдачаИнвесторуОригинал = Объект.СдачаИнвестору.Выгрузить();
	ТЗСдачаИнвесторуОригинал.ЗаполнитьЗначения("", "ДокументПоступления");
	ТЗСдачаИнвесторуОригинал.ЗаполнитьЗначения(0, "СуммаБезНДС");
	ТЗСдачаИнвесторуОригинал.ЗаполнитьЗначения(0, "СуммаНДС");
	ТЗСдачаИнвесторуОригинал.ЗаполнитьЗначения(0, "СуммаБезНДСПрочиеРасходы");
	ТЗСдачаИнвесторуОригинал.ЗаполнитьЗначения(0, "СуммаНДСПрочиеРасходы");
	
	ТЗСдачаИнвесторуОригинал.Свернуть("ОбъектНедвижимости, ПлощадьФактическая, СуммаЗатрат, НДСПоДДУ, ДокументПоступления, СуммаБезНДС, СуммаНДС, СуммаБезНДСПрочиеРасходы, СуммаНДСПрочиеРасходы, СчетРасчетов, Контрагент, Договор");
	
	ТЗСдачаИнвестору = Объект.СдачаИнвестору.Выгрузить();
	ТЗСдачаИнвестору.Очистить();
	
	ИтогоПлощадьФактическаяПринятиеКУчету = Объект.ПринятиеКУчету.Итог("ПлощадьФактическая");
	ИтогоСуммаЗатратПринятиеКУчету        = Объект.ПринятиеКУчету.Итог("СуммаЗатрат");
	
	ИтогоПлощадьФактическаяСдачаИнвестору = Объект.СдачаИнвестору.Итог("ПлощадьФактическая");
	ИтогоСуммаЗатратСдачаИнвестору        = Объект.СдачаИнвестору.Итог("СуммаЗатрат");
	
	Счет43 = ПланыСчетов.Хозрасчетный.ГотоваяПродукция;
	Счет68_02 = ПланыСчетов.Хозрасчетный.НДС;
	
	Для каждого Строка Из Объект.НДСИнвестиционный Цикл
		
		Сумма_ПринятиеКУчету = 0;
		Сумма_СдачаИнвестору = 0;
		БылоРаспределениеПринятиеКУчету = Ложь;
		БылоРаспределениеСдачаИнвестору = Ложь;
		
		Строка.СуммаНДСПринятиеКУчету = ?(ИтогоПлощадьФактическаяПринятиеКУчету + ИтогоПлощадьФактическаяСдачаИнвестору = 0 ,0,Строка.СуммаНДС * ИтогоПлощадьФактическаяПринятиеКУчету / (ИтогоПлощадьФактическаяПринятиеКУчету + ИтогоПлощадьФактическаяСдачаИнвестору));
		Строка.СуммаНДСПередачаИнвестору = Строка.СуммаНДС - Строка.СуммаНДСПринятиеКУчету;
		
		Для каждого СтрокаПринятиеКУчету Из ТЗПринятиеКУчетуОригинал Цикл			
			
			Если СтрокаПринятиеКУчету.ОбъектНедвижимости.ТипНедвижимости <> Перечисления.УПН_ТипыНедвижимости.Жилая Тогда
				Продолжить;
			КонецЕсли;			
			
			НоваяСтрока = ТЗПринятиеКУчету.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПринятиеКУчету);
			
			Если РаспределятьПоСуммеЗатрат Тогда
				СуммаНДС = ?(ИтогоСуммаЗатратПринятиеКУчету = 0, 0, Строка.СуммаНДСПринятиеКУчету / ИтогоСуммаЗатратПринятиеКУчету * СтрокаПринятиеКУчету.СуммаЗатрат)
			Иначе	
				СуммаНДС = ?(ИтогоПлощадьФактическаяПринятиеКУчету = 0, 0, Строка.СуммаНДСПринятиеКУчету / ИтогоПлощадьФактическаяПринятиеКУчету * СтрокаПринятиеКУчету.ПлощадьФактическая)
			КонецЕсли; 
			
			НоваяСтрока.СуммаНДС = СуммаНДС;
			
			Сумма_ПринятиеКУчету = Сумма_ПринятиеКУчету + НоваяСтрока.СуммаНДС;
			НоваяСтрока.ДокументПоступления = Строка.ДокументПоступления;
			НоваяСтрока.СчетСписанияНДС = ?(СтрокаПринятиеКУчету.ОбъектНедвижимости.ТипНедвижимости = Перечисления.УПН_ТипыНедвижимости.Жилая, Счет43, Счет68_02); 
			НоваяСтрока.СчетУчетаНДС    = Строка.СчетУчетаНДС; 
			ПересчитатьСуммуБезНДСВСтрокеТаблицы(НоваяСтрока, Строка.СтавкаНДС);
			БылоРаспределениеПринятиеКУчету = Истина;
			
		КонецЦикла;
		
		Для каждого СтрокаСдачаИнвестору Из ТЗСдачаИнвесторуОригинал Цикл
			
			НоваяСтрока = ТЗСдачаИнвестору.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСдачаИнвестору);
			Если РаспределятьПоСуммеЗатрат Тогда
				СуммаНДС = ?(ИтогоСуммаЗатратСдачаИнвестору = 0, 0, Строка.СуммаНДСПередачаИнвестору / ИтогоСуммаЗатратСдачаИнвестору * СтрокаСдачаИнвестору.СуммаЗатрат)
			Иначе	
				СуммаНДС = ?(ИтогоПлощадьФактическаяСдачаИнвестору = 0, 0, Строка.СуммаНДСПередачаИнвестору / ИтогоПлощадьФактическаяСдачаИнвестору * СтрокаСдачаИнвестору.ПлощадьФактическая)
			КонецЕсли; 
			
			НоваяСтрока.СуммаНДС = СуммаНДС;
			Сумма_СдачаИнвестору = Сумма_СдачаИнвестору + НоваяСтрока.СуммаНДС;
			ПересчитатьСуммуБезНДСВСтрокеТаблицы(НоваяСтрока, Строка.СтавкаНДС);
			
			НоваяСтрока.ДокументПоступления = Строка.ДокументПоступления;
			БылоРаспределениеСдачаИнвестору = Истина;
		КонецЦикла;
		
		Если НЕ Строка.СуммаНДСПринятиеКУчету = Сумма_ПринятиеКУчету И ТЗПринятиеКУчету.Количество() > 0  И БылоРаспределениеПринятиеКУчету Тогда
			ТЗПринятиеКУчету[ТЗПринятиеКУчету.Количество() - 1].СуммаНДС = ТЗПринятиеКУчету[ТЗПринятиеКУчету.Количество() - 1].СуммаНДС + (Строка.СуммаНДСПринятиеКУчету - Сумма_ПринятиеКУчету);
			ПересчитатьСуммуБезНДСВСтрокеТаблицы(ТЗПринятиеКУчету[ТЗПринятиеКУчету.Количество() - 1], Строка.СтавкаНДС);
		КонецЕсли; 
		
		Если НЕ Строка.СуммаНДСПередачаИнвестору = Сумма_СдачаИнвестору И ТЗСдачаИнвестору.Количество() > 0 И БылоРаспределениеСдачаИнвестору Тогда
			ТЗСдачаИнвестору[ТЗСдачаИнвестору.Количество() - 1].СуммаНДС = ТЗСдачаИнвестору[ТЗСдачаИнвестору.Количество() - 1].СуммаНДС + (Строка.СуммаНДСПередачаИнвестору - Сумма_СдачаИнвестору);
			ПересчитатьСуммуБезНДСВСтрокеТаблицы(ТЗСдачаИнвестору[ТЗСдачаИнвестору.Количество() - 1], Строка.СтавкаНДС);
		КонецЕсли; 
		
	КонецЦикла;  
	
	ТЗПринятиеКУчету.Свернуть("ОбъектНедвижимости, Номенклатура, ПлощадьФактическая, СуммаЗатрат, ДокументПоступления, СчетУчетаНДС, СчетСписанияНДС", "СуммаБезНДС, СуммаНДС");
	ТЗПринятиеКУчету.Сортировать("ОбъектНедвижимости, ДокументПоступления");
	
	ТЗСдачаИнвестору.Свернуть("ОбъектНедвижимости, ПлощадьФактическая, СуммаЗатрат, НДСПоДДУ, ДокументПоступления, СчетРасчетов, Контрагент, Договор", "СуммаБезНДС, СуммаНДС, СуммаБезНДСПрочиеРасходы, СуммаНДСПрочиеРасходы");
	ТЗСдачаИнвестору.Сортировать("ОбъектНедвижимости, ДокументПоступления");
	Объект.ПринятиеКУчету.Загрузить(ТЗПринятиеКУчету);
	Объект.СдачаИнвестору.Загрузить(ТЗСдачаИнвестору);
	
	ЗаполнитьДеревоПринятиеКУчету();
	ЗаполнитьДеревоСдачаИнвестору();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьИнвестиционныйНДСПоСуммеЗатрат(Команда)

	РаспределитьИнвестиционныйНДСНаСервере(Истина);
	ОбновитьИтоговыеПоказателиСервер();
	РазвернутьДеревья();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьИнвестиционныйНДСПоПлощали(Команда)
	
	
	РаспределитьИнвестиционныйНДСНаСервере(Ложь);
	ОбновитьИтоговыеПоказателиСервер();
	РазвернутьДеревья();
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДеревьями

&НаКлиенте
Процедура РазвернутьДеревья()

	Для Каждого Строка Из ДЗПринятиеКУчету.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДЗПринятиеКУчету.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;	
	
	Для Каждого Строка Из ДЗСдачаИнвестору.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДЗСдачаИнвестору.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПринятиеКУчету()

	ТаблицаИсточник = Объект.ПринятиеКУчету.Выгрузить();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПринятиеКУчету.ОбъектНедвижимости,
	|	ПринятиеКУчету.Номенклатура,
	|	ПринятиеКУчету.ПлощадьФактическая,
	|	ПринятиеКУчету.СуммаЗатрат,
	|	ПринятиеКУчету.ДокументПоступления,
	|	ПринятиеКУчету.СуммаБезНДС,
	|	ПринятиеКУчету.СуммаНДС,
	|	ПринятиеКУчету.СчетУчетаНДС,
	|	ПринятиеКУчету.СчетСписанияНДС
	|ПОМЕСТИТЬ ВТ_ПринятиеКУчету
	|ИЗ
	|	&ТаблицаИсточник КАК ПринятиеКУчету
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПринятиеКУчету.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	ВТ_ПринятиеКУчету.Номенклатура,
	|	ВТ_ПринятиеКУчету.ПлощадьФактическая КАК ПлощадьФактическая,
	|	ВТ_ПринятиеКУчету.СуммаЗатрат КАК СуммаЗатрат,
	|	ВТ_ПринятиеКУчету.ДокументПоступления КАК ДокументПоступления,
	|	ВТ_ПринятиеКУчету.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТ_ПринятиеКУчету.СуммаНДС КАК СуммаНДС,
	|	ВТ_ПринятиеКУчету.СчетУчетаНДС,
	|	ВТ_ПринятиеКУчету.СчетСписанияНДС
	|ИЗ
	|	ВТ_ПринятиеКУчету КАК ВТ_ПринятиеКУчету
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектНедвижимости,
	|	ДокументПоступления
	|ИТОГИ
	|	МАКСИМУМ(ПлощадьФактическая),
	|	МАКСИМУМ(СуммаЗатрат),
	|	СУММА(СуммаБезНДС),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОбъектНедвижимости";
	
	Запрос.МенеджерВременныхТаблиц=МенеджерВТ;
	Запрос.УстановитьПараметр("ТаблицаИсточник",ТаблицаИсточник);
	
	РезультатПакета=Запрос.ВыполнитьПакет();
	ИндексРезультата=РезультатПакета.Количество()-1;
	РезультатЗапроса=РезультатПакета[ИндексРезультата];
	
	ЗаполнитьДеревоПоРезультатуЗапроса(РезультатЗапроса, "ДЗПринятиеКУчету");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСдачаИнвестору()

	ТаблицаИсточник = Объект.СдачаИнвестору.Выгрузить();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СдачаИнвестору.СчетФактура,  
	|	СдачаИнвестору.ОбъектНедвижимости,
	|	СдачаИнвестору.ПлощадьФактическая,
	|	СдачаИнвестору.СуммаЗатрат,
	|	СдачаИнвестору.НДСПоДДУ,
	|	СдачаИнвестору.ДокументПоступления,
	|	СдачаИнвестору.СуммаБезНДС,
	|	СдачаИнвестору.СуммаНДС,
	|	СдачаИнвестору.СуммаБезНДСПрочиеРасходы,
	|	СдачаИнвестору.СуммаНДСПрочиеРасходы,
	|	СдачаИнвестору.СчетРасчетов,
	|	СдачаИнвестору.Контрагент,
	|	СдачаИнвестору.Договор
	|ПОМЕСТИТЬ ВТ_СдачаИнвестору
	|ИЗ
	|	&ТаблицаИсточник КАК СдачаИнвестору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СдачаИнвестору.СчетФактура, 
	|	ВТ_СдачаИнвестору.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	ВТ_СдачаИнвестору.ПлощадьФактическая КАК ПлощадьФактическая,
	|	ВТ_СдачаИнвестору.СуммаЗатрат КАК СуммаЗатрат,
	|	ВТ_СдачаИнвестору.НДСПоДДУ КАК НДСПоДДУ,
	|	ВТ_СдачаИнвестору.ДокументПоступления КАК ДокументПоступления,
	|	ВТ_СдачаИнвестору.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТ_СдачаИнвестору.СуммаНДС КАК СуммаНДС,
	|	ВТ_СдачаИнвестору.СуммаБезНДСПрочиеРасходы КАК СуммаБезНДСПрочиеРасходы,
	|	ВТ_СдачаИнвестору.СуммаНДСПрочиеРасходы КАК СуммаНДСПрочиеРасходы,
	|	ВТ_СдачаИнвестору.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_СдачаИнвестору.Контрагент КАК Контрагент,
	|	ВТ_СдачаИнвестору.Договор КАК Договор
	|ИЗ
	|	ВТ_СдачаИнвестору КАК ВТ_СдачаИнвестору
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектНедвижимости,
	|	ДокументПоступления
	|ИТОГИ
	|	МАКСИМУМ(ПлощадьФактическая),
	|	МАКСИМУМ(СуммаЗатрат),
	|	МАКСИМУМ(НДСПоДДУ),
	|	СУММА(СуммаБезНДС),
	|	СУММА(СуммаНДС),
	|	СУММА(СуммаБезНДСПрочиеРасходы),
	|	СУММА(СуммаНДСПрочиеРасходы)
	|ПО
	|	ОбъектНедвижимости";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ТаблицаИсточник",ТаблицаИсточник);
	
	РезультатПакета=Запрос.ВыполнитьПакет();
	ИндексРезультата=РезультатПакета.Количество()-1;
	РезультатЗапроса=РезультатПакета[ИндексРезультата];
	
	ЗаполнитьДеревоПоРезультатуЗапроса(РезультатЗапроса, "ДЗСдачаИнвестору");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПоРезультатуЗапроса(РезультатЗапроса, РеквизитФормы)
	
	ДеревоОбъект=РеквизитФормыВЗначение(РеквизитФормы, Тип("ДеревоЗначений"));
	ДеревоОбъект.Строки.Очистить();
	
	ДеревоРезультат=РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ИтогоСуммаНДС_ПринятиеКУчету = 0;
	
	ЗаполнитьПодчиненныеСтроки(ДеревоОбъект, ДеревоРезультат, РеквизитФормы);
	ЗначениеВРеквизитФормы(ДеревоОбъект, РеквизитФормы);
	//Элементы[РеквизитФормы].НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеСтроки(ПриемникРодитель, ИсточникРодитель, РеквизитФормы)
	
	Для Каждого СтрокаИсточника ИЗ ИсточникРодитель.Строки Цикл
		СтрокаПриемника=ПриемникРодитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриемника,СтрокаИсточника);
		Если СтрокаИсточника.Уровень() = 0 Тогда
			СтрокаПриемника.ОбъектНедвижимости = СтрокаИсточника.ОбъектНедвижимости;
			СтрокаПриемника.ЭтоОбъектНедвижимости = Истина
		Иначе	
			Если РеквизитФормы = "ДЗСдачаИнвестору" Тогда
				СтрокаПриемника.НДСПоДДУ = 0;	
			Иначе
				СтрокаПриемника.ОбъектНедвижимости = СтрокаИсточника.Номенклатура;	
				ИтогоСуммаНДС_ПринятиеКУчету = ИтогоСуммаНДС_ПринятиеКУчету + СтрокаИсточника.СуммаНДС;
			КонецЕсли; 
		    СтрокаПриемника.СуммаЗатрат = 0;
			СтрокаПриемника.ПлощадьФактическая = 0;
		КонецЕсли; 
		
		ЗаполнитьПодчиненныеСтроки(СтрокаПриемника,СтрокаИсточника, РеквизитФормы);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДЗПринятиеКУчетуСуммаБезНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДЗПринятиеКУчету.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(ТекущаяСтрока, ПолучитьСтавкуНДСНаСервере(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ДокументПоступления));
	Родитель = ТекущаяСтрока.ПолучитьРодителя();
	Если Родитель<>Неопределено Тогда
		ОбновитьИтоговыеПоказателиПринятиеКУчету(Родитель);
	КонецЕсли;
	ОбновитьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДЗПринятиеКУчетуСуммаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДЗПринятиеКУчету.ТекущиеДанные;
	ПересчитатьСуммуБезНДСВСтрокеТаблицы(ТекущаяСтрока, ПолучитьСтавкуНДСНаСервере(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ДокументПоступления));

	Родитель = ТекущаяСтрока.ПолучитьРодителя();
	Если Родитель<>Неопределено Тогда
		ОбновитьИтоговыеПоказателиПринятиеКУчету(Родитель);
	КонецЕсли;
	ОбновитьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТаблицуПриПерезаполнении(ЭлементДерева, ИмяТаблицы, ТекущийОбъект = Неопределено)
	
	Родитель=ЭлементДерева.ПолучитьРодителя();
	Если Родитель<>Неопределено Тогда

		Если ТекущийОбъект = Неопределено Тогда
			НоваяСтрока = Объект[ИмяТаблицы].Добавить();
		Иначе
			НоваяСтрока = ТекущийОбъект[ИмяТаблицы].Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементДерева);
		НоваяСтрока.ПлощадьФактическая = Родитель.ПлощадьФактическая;
		НоваяСтрока.СуммаЗатрат        = Родитель.СуммаЗатрат;
		Если ИмяТаблицы = "ПринятиеКУчету" Тогда
			НоваяСтрока.ОбъектНедвижимости = Родитель.ОбъектНедвижимости;
		Иначе	
			НоваяСтрока.НДСПоДДУ        = Родитель.НДСПоДДУ;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодчиненныеСтрокиПриПерезаполнении(ЭлементДереваРодитель, ИмяТаблицы, ТекущийОбъект = Неопределено)
	ЭлементыДерева=ЭлементДереваРодитель.ПолучитьЭлементы();
	Для Каждого ЭлементДерева ИЗ ЭлементыДерева Цикл
		Если ЭлементДерева.ЭтоОбъектНедвижимости Тогда
			ОбработатьПодчиненныеСтрокиПриПерезаполнении(ЭлементДерева, ИмяТаблицы, ТекущийОбъект);
		Иначе
			ДобавитьСтрокуВТаблицуПриПерезаполнении(ЭлементДерева, ИмяТаблицы, ТекущийОбъект);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НДСИнвестиционныйНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НДСИнвестиционный.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС"));
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
    ПересчитатьСуммуНДСВСтрокеТаблицы(ТекущаяСтрока, ТекущаяСтрока.СтавкаНДС);

КонецПроцедуры

&НаКлиенте
Процедура ДЗПринятиеКУчетуПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДЗСдачаИнвесторуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ДЗСдачаИнвестору.ТекущиеДанные;
	Если Поле.Имя = "ДЗСдачаИнвесторуСчетФактура" И ЗначениеЗаполнено(ТекСтрока.СчетФактура) Тогда
		ПоказатьЗначение(,ТекСтрока.СчетФактура);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
